/*
 * 
 * parse.c
 * Saturday, 3/22/1997.
 * Craig Fitzgerald
 * 
 * 
 * ====================================================================
 * 
 * program             - {typedef | declaration} ...
 * 
 * typedef             - <later>
 * 
 * declaration         - typespec declarator_list ';'
 * declarator_list     - declarator [',' declarator]@
 * declarator          - ident {var_declarator | fn_declarator}
 * var_declarator      - {'=' expression | null}
 * fn_declarator       - initparmlist {compoundstatement | ';' | ':' number ';'}
 * 
 * typespec            - 'int' | 'float' | 'char' | 'string'
 * ident               -
 * 
 * initparmlist        - '(' {initparmentry | 'void'} ')'
 * initparmentry       - typespec ident [',' typespec ident]@
 * parmvalues          - typespec ident [',' parmvalues]
 * 
 * compoundstatement   - '{' statementlist '}'
 * statementlist       - statement [statementlist]
 * 
 * statement           - compoundstatement
 *                       declaration
 *                       expression;
 *                       'if' '(' expression ')' statement
 *                       'if' '(' expression ')' statement 'else' statement
 *                       'while' '(' expression ')' statement
 *                       'for' '(' [expr1]; [expr2]; [expr3] ')' statement
 *                       'switch' '(' expression ')' statement
 *                       'case' expression ':' statement
 *                       'default' ':' statement

            {
            if (TokEat (TOK_INTLITERAL))
             pInternalID = NodeBuild ();
            TokEat (TOK_SEMICOLON);
            }
         else
            {
            PushScope (SCOPE_LOCAL);
            pBody = ParseCompoundStatement ();
            PopScope ();
            *pbDefinition = TRUE;
            }
         }
		NodeSetTypeList (pIdent, ptlst, 1);
      return NodeBuild4 (TOK_FUNCTION, pIdent, pParm, pInternalID, pBody);
      }
   else // variable declaration
      {
	   for (iDimension=0; TokTry (TOK_OBRACKET); iDimension++) // an array decl?
         {
//       pASize = ParseMaybeExpression (TOK_CBRACKET);
//			ptlst  = TLAddAtPos (ptlst, iDimension, TLNewArrayElement (pASize));

			BOOL bHash;
			pnode 	= ParseBracketContents (&bHash); // pnode = Array Size or hash key type
			ptlstNew = (bHash ? TLNewHashElement (pnode) : TLNewArrayElement (pnode));
			ptlst  	= TLAddAtPos (ptlst, iDimension, ptlstNew);

         TokEat (TOK_CBRACKET);
         }
      SetScope (pIdent); // this potentially replaces the symbol with a local copy

		NodeSetTypeList (pIdent, ptlst, 1); // put type modifications on identifier

      if (TokTry (TOK_EQUALS))
         pInit = ParseInitializer ();

      return NodeBuild2 (TOK_VARIABLE, pIdent, pInit);
      }
   }


PNODE ParseDeclaratorList (PBOOL pbDefn)
   {
   PNODE pDecl, pHead = NULL;

   while (TRUE)
      {
      pDecl = ParseDeclarator (pbDefn);
      pHead = NodeAddToEnd (pHead, pDecl);

      if (*pbDefn || !TokTry(TOK_COMMA))
         break;
      }
   return pHead;
   }

/***************************************************************************/
/***************************************************************************/
/***************************************************************************/
/***************************************************************************/


PNODE ParseStructDefinition (void)
   {
   PNODE pList, pHead = NULL;
   BOOL  bDefinition;

   TokEat (TOK_OBRACE);
   while (TRUE)
      {
      pList = ParseDeclaration (&bDefinition);
      if (bDefinition)
         NodeError (pList, "function definition in a struct?");
      TokEat (TOK_SEMICOLON);

      pHead = NodeAddToEnd (pHead, pList);
      if (TokTry (TOK_CBRACE))
         break;
      }
   return pHead;
   }


PNODE ParseTypespec (void)
   {
   PNODE pTyp;

   TokGet ();
   pTyp = NodeBuild ();

   /*--- basic typespec like int or char ---*/
   if (TokTypIsBaseType (pTyp->uID))
      return pTyp;

   /*-- previously defined user defined typedef like PSZ ---*/
   if (pTyp->uID == TOK_IDENTIFIER && pTyp->ps->uKind == KIND_TYPEDEF)
      return pTyp;

   if (pTyp->uID == TOK_IDENTIFIER)
      NodeError (pTyp, "datatype or 'struct' expected, got '%s'", pTyp->ps->pszLiteral);

   if (pTyp->uID != TOK_STRUCT && pTyp->uID != TOK_UNION)
      NodeError (pTyp, "datatype, 'struct' or 'union' expected, got '%s'", Token.pszString);

   /*--- struct ---*/
   if (TokPeek () == TOK_OBRACE) /*--- unnamed struct definition ---*/
      {
      pTyp->pn1 = NodeBuild ();
      NodeBuild1 (TOK_IDENTIFIER, NULL);
      pTyp->pn1->ps = SymAdd ("__unnamed", 1);
      }
   else
      {
      TokEat (TOK_IDENTIFIER);
      pTyp->pn1 = NodeBuild ();
      pTyp->pn1->ps = NotStructElement (pTyp->pn1->ps);
   
      if (pTyp->pn1->ps->uKind && pTyp->pn1->ps->uKind != KIND_STRUCTDEF)
         ParseError ("identifier not a struct: %s", pTyp->pn1->ps->pszLiteral);
      }
   pTyp->pn1->ps->uKind  = KIND_STRUCTDEF; // we need this for future parsing
   pTyp->pn1->ps->bUnion = (pTyp->uID == TOK_UNION);

   if (TokPeek () == TOK_OBRACE) /*--- struct definition ---*/
      {
      PushScope (SCOPE_STRUCT);

      if (pTyp->pn1->ps->ppElements)
         ParseError ("struct redefinition: %s", pTyp->pn1->ps->pszLiteral);

      pTyp->pn2 = ParseStructDefinition ();
      CheckStructDef (pTyp); // this puts struct def into the symbol & then free's pn2
      PopScope ();
      }
   return pTyp;
   }


/***************************************************************************/
/***************************************************************************/
/***************************************************************************/
/***************************************************************************/


PNODE ParseDeclaration (PBOOL pbDefn)
   {
   PNODE pType, pList;

   pType = ParseTypespec ();

	// typespec could be a struct defn, and decl vars would be optional
   pList = ParseDeclaratorList (pbDefn);
   return NodeBuild2 (TOK_DECLARATIONLIST, pType, pList);
   }



PNODE ParseDeclarationStatement (void)
   {
   PNODE pDecl;
   BOOL  bDefinition;

   pDecl = ParseDeclaration (&bDefinition);
   if (!bDefinition)
      TokEat (TOK_SEMICOLON);
   return pDecl;
   }


PNODE ParseTypedefIdentifier (void)
	{
	PTLST ptlstNew, ptlst  = NULL;
	PNODE pIdent, pnode;

   while (TokTry (TOK_STAR))
		ptlst = TLAddToHead (ptlst, DATATYPE_PTR);

   TokEat (TOK_IDENTIFIER);
   pIdent 	  = NodeBuild ();
   pIdent->ps = NotStructElement (pIdent->ps);

   if (pIdent->ps->uKind)
      ParseError ("identifier already defined: %s", pIdent->ps->pszLiteral);
   else
      pIdent->ps->uKind = KIND_TYPEDEF; // we need this for future parsing

   for (int iDimension=0; TokTry (TOK_OBRACKET); iDimension++) // an array decl?
      {
		//    pASize = ParseMaybeExpression (TOK_CBRACKET);
		//		ptlst  = TLAddAtPos (ptlst, iDimension, TLNewArrayElement (pASize));

		BOOL bHash;
		pnode 	= ParseBracketContents (&bHash); // pnode = Array Size or hash key type
		ptlstNew = (bHash ? TLNewHashElement (pnode) : TLNewArrayElement (pnode));
		ptlst  	= TLAddAtPos (ptlst, iDimension, ptlstNew);

      TokEat (TOK_CBRACKET);
      }
	NodeSetTypeList (pIdent, ptlst, 1); // put type modifications on identifier
	return pIdent;
	}


PNODE ParseTypedef (void)
   {
   PNODE  pType, pIdent, pNewIdent;

   TokEat (TOK_TYPEDEF);
   pType = ParseTypespec ();

	pIdent = ParseTypedefIdentifier ();
	while (TokTry (TOK_COMMA))
		{
		pNewIdent = ParseTypedefIdentifier ();
		pNewIdent->next = pIdent;
		pIdent = pNewIdent;
		}
   TokEat (TOK_SEMICOLON);

   return NodeBuild2 (TOK_TYPEDEF, pType, pIdent);
   }


/*
 * The compilation process is driven from here
 * Heres the drill:
 * loop
 *    {
 *    parse declaration
 *    check declaration
 *    generate declaration
 *    free parse tree
 *    }
 * dump globals
 *
 * no linking takes place, functions are generated one at a time
 * globals and statics are stored and dumped in a block at the end
 *
 */
void CompileDriver (void)
   {
   PNODE pnode;

   PushScope (SCOPE_GLOBAL);
   while (TRUE)
      {
      TokPeek ();
      if (Token.bEOF)
         break;

      if (Token.uID == TOK_TYPEDEF)
         {
         pnode = ParseTypedef ();
         CheckTypedef (pnode);
			pnode = NodeFreeTree (pnode);
         }
      else
         {
         pnode = ParseDeclarationStatement ();

         if (LOG_VAL & 0x08)
            PrintTree (pnode, 0);

         CheckDeclaration (pnode);
         GenDeclaration (pnode);
         }
      }
   GenGlobals ();
   PopScope ();
   }

/***************************************************************************/
/*                                                                         */
/*                                                                         */
/*                                                                         */
/***************************************************************************/


void indent (UINT uIndent)
   {
   for (; uIndent; uIndent--)
      Log (8, " ");
   }


void PTree (PNODE pnode, UINT uIndent)
   {
   if (!pnode)
      return;

#if defined (_DEBUG)
   Log (8, "ID:%3d[%s]  STR:%-16s  LIT:%-24s\n", 
            pnode->uID, NodeIDToName (pnode->uID),
            TokReservedString(pnode->uID), (pnode->ps ? pnode->ps->pszLiteral : ""));
#else
   Log (8, "ID:%3d  STR:%-16s  LIT:%-24s\n", 
            pnode->uID, TokReservedString(pnode->uID), (pnode->ps ? pnode->ps->pszLiteral : ""));
#endif
   if (pnode->pn1) 
      {indent (uIndent); Log (8, "p1:"); PTree (pnode->pn1, uIndent+3);}
   if (pnode->pn2) 
      {indent (uIndent); Log (8, "p2:"); PTree (pnode->pn2, uIndent+3);}
   if (pnode->pn3) 
      {indent (uIndent); Log (8, "p3:"); PTree (pnode->pn3, uIndent+3);}
   if (pnode->pn4) 
      {indent (uIndent); Log (8, "p4:"); PTree (pnode->pn4, uIndent+3);}
   if (pnode->next)
      {
      indent (uIndent); 
      Log (8, "xt: <next>\n");
      indent (uIndent); 
      PTree (pnode->next, uIndent);
      }
   }

void PrintTree (PNODE pnode, UINT uIndent)
   {
   Log (8, "************************[ParseTree]**************************\n");
   PTree (pnode, uIndent);
   }


#if defined (_DEBUG)

PSZ NodeIDToName (int iID)
	{
	switch (iID)
		{
      case TOK_EOF              : return "EOF"					; //0         
      case TOK_LESSTHAN         : return "LESSTHAN"			; //1         
      case TOK_GREATERTHAN      : return "GREATERTHAN"		; //2         
      case TOK_LESSOREQUAL      : return "LESSOREQUAL"		; //3         
      case TOK_GREATEROREQUAL   : return "GREATEROREQUAL"	; //4         
      case TOK_EQUIVALENT       : return "EQUIVALENT"			; //5         
      case TOK_NOTEQUAL         : return "NOTEQUAL"			; //6         
      case TOK_EQUALS           : return "EQUALS"				; //7         
      case TOK_PLUSEQUAL        : return "PLUSEQUAL"			; //8         
      case TOK_MINUSEQUAL       : return "MINUSEQUAL"			; //9         
      case TOK_STAREQUAL        : return "STAREQUAL"			; //10        
      case TOK_SLASHEQUAL       : return "SLASHEQUAL"			; //11        
      case TOK_PERCENTEQUAL     : return "PERCENTEQUAL"		; //12        
      case TOK_SHIFTRIGHTEQUAL  : return "SHIFTRIGHTEQUAL"	; //13        
      case TOK_SHIFTLEFTEQUAL   : return "SHIFTLEFTEQUAL"	; //14
      case TOK_ANDEQUAL         : return "ANDEQUAL"			; //15
      case TOK_XOREQUAL         : return "XOREQUAL"			; //16
      case TOK_OREQUAL          : return "OREQUAL"				; //17
      case TOK_LOGICALOR        : return "LOGICALOR"			; //18
      case TOK_LOGICALAND       : return "LOGICALAND"			; //19
      case TOK_EXCLAMATION      : return "EXCLAMATION"		; //20
      case TOK_AMPERSAND        : return "AMPERSAND"			; //21
      case TOK_OR               : return "OR"					; //22
      case TOK_HAT              : return "HAT"					; //23
      case TOK_SHIFTRIGHT       : return "SHIFTRIGHT"			; //24
      case TOK_SHIFTLEFT        : return "SHIFTLEFT"			; //25
      case TOK_TILDA            : return "TILDA"				; //26
      case TOK_INCREMENT        : return "INCREMENT"			; //27
      case TOK_DECREMENT        : return "DECREMENT"			; //28
      case TOK_ARROW            : return "ARROW"				; //29
      case TOK_SLASH            : return "SLASH"				; //30
      case TOK_PERCENT          : return "PERCENT"				; //31
      case TOK_STAR             : return "STAR"					; //32
      case TOK_MINUS            : return "MINUS"				; //33
      case TOK_PLUS             : return "PLUS"					; //34
      case TOK_OCOMMENT         : return "OCOMMENT"			; //35
      case TOK_CCOMMENT         : return "CCOMMENT"			; //36
      case TOK_CPPCOMMENT       : return "CPPCOMMENT"			; //37
      case TOK_AT               : return "AT"					; //38
      case TOK_POUND            : return "POUND"				; //39
      case TOK_DOLLAR           : return "DOLLAR"				; //40
      case TOK_BACKSLASH        : return "BACKSLASH"			; //41
      case TOK_OPAREN           : return "OPAREN"				; //42
      case TOK_CPAREN           : return "CPAREN"				; //43
      case TOK_OBRACKET         : return "OBRACKET"			; //44
      case TOK_CBRACKET         : return "CBRACKET"			; //45
      case TOK_OBRACE           : return "OBRACE"				; //46
      case TOK_CBRACE           : return "CBRACE"				; //47
      case TOK_SINGLEQUOTE      : return "SINGLEQUOTE"		; //48
      case TOK_DOUBLEQUOTE      : return "DOUBLEQUOTE"		; //49
      case TOK_COMMA            : return "COMMA"				; //50
      case TOK_PERIOD           : return "PERIOD"				; //51
      case TOK_QUESTION         : return "QUESTION"			; //52
      case TOK_COLON            : return "COLON"				; //53
      case TOK_SEMICOLON        : return "SEMICOLON"			; //54
      case TOK_IF               : return "IF"					; //55
      case TOK_ELSE             : return "ELSE"					; //56
      case TOK_FOR              : return "FOR"					; //57
      case TOK_WHILE            : return "WHILE"				; //58
      case TOK_SWITCH           : return "SWITCH"				; //59
      case TOK_CASE             : return "CASE"					; //60
      case TOK_DEFAULT          : return "DEFAULT"				; //61
      case TOK_BREAK            : return "BREAK"				; //62
      case TOK_CONTINUE         : return "CONTINUE"			; //63
      case TOK_RETURN           : return "RETURN"				; //64
      case TOK_TYPEDEF          : return "TYPEDEF"				; //65
      case TOK_SIZEOF           : return "SIZEOF"				; //66
      case TOK_VOID             : return "VOID"					; //67
      case TOK_CHAR             : return "CHAR"					; //68
      case TOK_SHORT            : return "SHORT"				; //69
      case TOK_INT              : return "INT"					; //70
      case TOK_LONG             : return "LONG"					; //71
      case TOK_FLOAT            : return "FLOAT"				; //72
      case TOK_STRING           : return "STRING"				; //73
      case TOK_STRUCT           : return "STRUCT"				; //74
      case TOK_UNION            : return "UNION"				; //75
      case TOK_INCLUDE          : return "INCLUDE"				; //76
      case TOK_DEFINE           : return "DEFINE"				; //77
      case TOK_DUMPSYM          : return "DUMPSYM"				; //78
      case TOK_IDENTIFIER       : return "IDENTIFIER"			; //79
      case TOK_CHARLITERAL      : return "CHARLITERAL"		; //80
      case TOK_SHORTLITERAL     : return "SHORTLITERAL"		; //81
      case TOK_LONGLITERAL      : return "LONGLITERAL"		; //82
      case TOK_INTLITERAL       : return "INTLITERAL"			; //83
      case TOK_FLOATLITERAL     : return "FLOATLITERAL"		; //84
      case TOK_STRINGLITERAL    : return "STRINGLITERAL"		; //85
      case TOK_DECLARATIONLIST  : return "DECLARATIONLIST"	; //86 
      case TOK_COMPOUNDSTATEMENT: return "COMPOUNDSTATEMENT"; //87 
      case TOK_EXPR             : return "EXPR"					; //88
      case TOK_FUNCTION         : return "FUNCTION"			; //89
      case TOK_VARIABLE         : return "VARIABLE"			; //90
      case TOK_LITERAL          : return "LITERAL"				; //91
      case TOK_FTOW             : return "FTOW"					; //92
      case TOK_WTOF             : return "WTOF"					; //93
      case TOK_DEREF            : return "DEREF"				; //94
      case TOK_ADDROF           : return "ADDROF"				; //95
      case TOK_SHL1             : return "SHL1"					; //96
      case TOK_SHL2             : return "SHL2"					; //97
      case TOK_SHL3             : return "SHL3"					; //98
      case TOK_INITLIST         : return "INITLIST"			; //99
      case TOK_CAST             : return "CAST"					; //100
		}
	return "***UNKNOWN***"; 
	}
#endif
